linux-app/ref.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2019-11-25 Mon 12:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Linux Application Programming</title>
<meta name="generator" content="Org mode">
<meta name="author" content="王晓林">
<link rel="stylesheet" href="https://cs6.swfu.edu.cn/org.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">Linux Application Programming
<br>
<span class="subtitle">Textbooks and References</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4235d58">Textbooks</a></li>
<li><a href="#org613e12f">References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4235d58" class="outline-2">
<h2 id="org4235d58">Textbooks</h2>
<div class="outline-text-2" id="text-org4235d58">
<ol class="org-ol">
<li>Matthew, Neil and Stones, Richard. <a href="https://cs6.swfu.edu.cn/calibre/#book_id=39&amp;library_id=calibre&amp;panel=book_details"><i>Beginning Linux Programming</i></a>, 4<sup>th</sup> edition, 2008.</li>
<li>Mendel Cooper. <a href="https://www.tldp.org/LDP/abs/html/"><i>Advanced Bash Scripting Guide 5.3 Volume 1</i></a>, Lulu.com, 2010.</li>
</ol>
</div>
</div>

<div id="outline-container-org613e12f" class="outline-2">
<h2 id="org613e12f">References</h2>
<div class="outline-text-2" id="text-org613e12f">
<ol class="org-ol">
<li>Stevens, W Richard and Rago, Stephen A. <a href="https://cs6.swfu.edu.cn/calibre/#book_id=145&amp;library_id=calibre&amp;panel=book_details"><i>Advanced programming in the UNIX environment</i></a>,
Addison-Wesley, 3<sup>rd</sup> edition, 2013.</li>
<li>Raymond, Eric S. <a href="https://cs6.swfu.edu.cn/calibre/#book_id=15&amp;library_id=calibre&amp;panel=book_details"><i>The art of Unix programming</i></a>, Addison-Wesley, 2003.</li>
<li>Love, R. <a href="https://cs6.swfu.edu.cn/calibre/#book_id=13&amp;library_id=calibre&amp;panel=book_details"><i>Linux System Programming: Talking Directly to the Kernel and C Library</i></a>,
O'Reilly Media, 2<sup>nd</sup> edition, 2007.</li>
<li>Kerrisk, Michael. <a href="https://cs6.swfu.edu.cn/calibre/#book_id=166&amp;library_id=calibre&amp;panel=book_details"><i>The Linux Programming Interface: A Linux and UNIX System Programming
Handbook</i></a>, No Starch Press, 2010.</li>
<li>Bryant, Randal E. and O'Hallaron, David R. <a href="https://cs6.swfu.edu.cn/calibre/#book_id=33&amp;library_id=calibre&amp;panel=book_details"><i>Computer Systems: A Programmer's Perspective</i></a>. Addison-Wesley, 2<sup>nd</sup> edition, 2010.</li>
<li><a href="http://cs241.cs.illinois.edu/coursebook/index.html">CS241 System Programming Coursebook</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 王晓林</p>
<p class="date">Created: 2019-11-25 Mon 12:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
